#+TITLE: Emacs ORG

#+OPTIONS: ^:nil

* Move
** Back to upper title
C-c C-u


* Edit
** Inset title
M-RET
** Insert a TODO
M-S-RET
** Promote or demote current title
M-LEFT/RIGHT
** Promote or demote current subtree
M-S-LEFT/RIGHT
** Move current subtree up/down
M-S-UP/DOWN
** Narrow down or wide out current subtree
C-x n s/w
** Show current branch in new buffer
C-c C-x b
** Transfer
C-c C-w
** Toggle outline view
C-c C-j
** Set current line as title
C-c *


* Sparse tree
** Select sparse tree
C-c /
** Cancel highlight
C-c C-c


* Text list
** Change checkbox state
C-c C-c
** Cycle mark of list
C-c -


* Footnote
** Insert footnote
C-c C-x f
** Jump between footnote and definition
C-c C-c










* Table
** Move column L/R
M-LEFT/RIGHT
** Move column U/D
M-UP/DOWN
** Add horizontal line under current line (uppon current line if with prefix)
C-c -
** Add horizontal line under current line (move cursor to next line)
C-c RET
** Sort (according to current column)
C-c ^


** Define one column using a formula in terms of others
To recalculate the column, put the cursor on the #+TBLFM column and hit ctrl-c twice
#+BEGIN_SRC
| airmass | zenith_seeing | delivered_seeing |
|---------+---------------+------------------|
|     1.3 |          0.95 |        1.1119612 |
|     1.3 |           1.0 |        1.1704854 |
|     1.3 |           1.1 |        1.2875340 |
|     1.3 |           1.2 |        1.4045825 |
|     1.3 |          1.25 |        1.4631068 |
|     1.3 |           1.3 |        1.5216311 |
|     1.3 |           1.5 |        1.7557281 |
|     1.3 |           1.8 |        2.1068738 |
|     1.2 |           1.8 |        2.0080811 |
|     1.3 |           2.0 |        2.3409709 |
#+TBLFM: $3=$2*($1**0.6)
#+END_SRC

* TODO
** Toggle state
C-c C-t
** Show global TODO list
C-c a t


* Time
** Insert time
C-c .
** Insert timestamp
M-0 C-c .


* Html
#+BEGIN_SRC html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style.css" />
#+END_SRC
#+BEGIN_SRC html
#+CAPTION: xxxxxx
#+LABEL: fig:SED-HR40
[[/path/to/file]]
#+END_SRC

* General metadata
#+BEGIN_SRC
#+TITLE:     Emacs Org
#+AUTHOR:    Hao Ruan
#+EMAIL:     ryan.ruan@ericsson.com
#+END_SRC
